// Вивести на екран всі числа від 1 до 10 за допомогою циклу while.

// let i = 1; 

// while (i < 10) {
//   i += 1; 
//   console.log(i);
// }


// Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for.
//  Якщо число не парне, пропустити його за допомогою continue.

// for (let i = 2; i <= 20; i+= 1) { 
//   if (i % 2 === 0) {
//     console.log(i);
//   } else { 
//     continue;
//   }
// };


// Вивести на екран таблицю множення числа 7 за допомогою циклу for.

// for (let i = 1; i <= 10; i += 1) { 
//   const result = 7 * i;
//   console.log(`7 Помножити на ${i} = ${result}`);
// };


// Створити масив з числами від 1 до 5.
// Вивести на екран кожен елемент масиву за допомогою циклу while.

// const numbers = [1, 2, 3, 4, 5]; 

// let j = 0;
// while (j < numbers.length) { 
//   console.log(numbers[j]);
//   j +=1;
// };


// Створити масив із числами від 1 до 10.
//  За допомогою циклу for пройтися по масиву та вивести на екран всі числа,
//   крім числа 7. Якщо зустрінете число 7,
//    закінчити виконання циклу за допомогою оператора break.

// const secondNubers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (let i = 0; i <= secondNubers.length; i +=1) { 
//   if (secondNubers[i] === 7) { 
//     break; 
//   } else { 
//     console.log(secondNubers[i]);
//   }
// };


// Створити скрипт, який виводить на екран всі числа, які менші за n.
//  Якщо зустрічається число, що більше або дорівнює n,
//  цикл повинен бути закінчений за допомогою break.

// const n = Number(prompt('Введіть число'));
// for (let i = 0; i < n; i += 1) { 
//   console.log(i);
//   if (i === n || i > n) {
//     break;
//   }
// }


// За допомогою циклу while вивести на екран всі числа від 1 до 20,
//  крім чисел, кратних 3. Якщо зустрінете число, кратне 3,
//   цикл повинен продовжити виконання за допомогою оператора continue.

let l = 1; 
while (l < 20) { 
  if (l % 3 === 0) {
    l += 1;
    continue;
  } else { 
    console.log(l);
    l +=1;
  };
}